[
    {
        "topic_name": "Topic 1: us, eurovision, sudan, says, ceasefire",
        "titles_in_topic": [
            "Amazon trials new humanoid robot. #Shorts #Robot #BBCNews",
            "Gaza is one of the most densely populated areas on Earth. #Israel #Gaza #BBCNews",
            "Three-time WWE world champion Bray Wyatt has died at the age of 36. #Shorts #Wrestling #BrayWyatt",
            "This driver barely missed a customer after crashing into a salon in Arizona. #Shorts #CCTV #BBCNews",
            "Russian missile strike hits Ukrainian city centre of Kramatorsk  – BBC News",
            "Day of mourning in Pakistan after Greece boat disaster - BBC News",
            "iPhone maker Foxconn switch to cars as US-China tensions rise - BBC News",
            "Greece boat disaster: Up to 500 people still missing, UN says – BBC News",
            "Greece migrant boat disaster: What we know so far - BBC News",
            "Three days of mourning in Greece after migrant boat disaster - BBC News",
            "Silvio Berlusconi state funeral takes place in Italy - BBC News",
            "Nottingham: Murder arrest after three dead in UK city centre - BBC News",
            "Silvio Berlusconi, former Italy PM, dies aged 86 - BBC News",
            "Trump charged under Espionage Act for taking US nuclear secrets  - BBC News",
            "Car crashes into lamp-post during driving test in Argentina. #Shorts #Argentina #Driving #BBCNews",
            "Tens of millions under air quality warnings as fires burn - BBC News",
            "Russia has blown up major Ukrainian dam, says Kyiv - BBC News",
            "Why does Britain have the worst inflation in the G7? - BBC Newsnight",
            "Myanmar coup: Russia supplying military with advanced fighter jets - BBC News",
            "US debt ceiling bill approved by Senate - BBC News",
            "Andrew Tate BBC interview: Influencer challenged on misogyny and rape allegations - BBC News",
            "North Korea spy satellite launch ends in failure - BBC News",
            "Turns out elephants are no match for bees.  #Shorts  #BBCNews",
            "Madeleine McCann: Portugal reservoir search appears to be over - BBC News",
            "Ron DeSantis: Twitter campaign launch hits technical issues - BBC News",
            "Sudan’s new ceasefire appears to be holding - BBC News",
            "Turkey elections: Run-off likely as Erdogan edges ahead of Kilicdaroglu - BBC News",
            "Turkey prepares to vote in knife-edge elections in wake of earthquake destruction - BBC News",
            "Moment Sweden&#39;s Loreen wins Eurovision 2023 #Shorts #Eurovision #BBCNews",
            "When you bump into Graham Norton in the Eurovision fan zone #Shorts #Eurovision #BBCNews",
            "Eurovision: Ukrainian refugees bring their history to life at Liverpool festival - BBC Newsnight",
            "Moment BBC reporter confuses fan with Finland&#39;s Eurovision entry. #Shorts #Eurovision #BBCNews",
            "Israel Gaza strikes kill top militants and multiple civilians- BBC News",
            "Russia’s Victory Day parade: President Putin calls for &#39;victory&#39; - BBC News",
            "St Kitts and Nevis is not totally free under King Charles III, says PM – BBC News",
            "TikTok tracked UK journalist via her cat&#39;s account – BBC News",
            "Scottish turntable ferry last surviving in the world – BBC News",
            "Coronation: The audacious attempted theft of the Crown Jewels - BBC News",
            "Controlled explosion after man arrested outside Buckingham Palace, London police say - BBC News",
            "US could face economic turmoil if another bank faces collapse, money bosses warn - BBC News",
            "Sudan hit with air strikes despite truce - BBC News",
            "The US tech millionaire trying to reverse his age - BBC News",
            "Sudan: Millions trapped or fleeing as ceasefire unravels – BBC News",
            "US and Philippines conclude their largest ever military exercises  - BBC News",
            "TikToker trapped in gambling addiction that nearly destroyed his life - BBC Newsnight",
            "US pours trillions of dollars of public funds into new green industries - BBC News",
            "Warring sides agree to ceasefire in Sudan – BBC News",
            "Out of the Shadows: Born from Rape | BBC News",
            "Sudan army says foreign nationals to be evacuated as Khartoum fighting continues - BBC News",
            "Why has Apple launched its first store in India? - BBC News",
            "Sudan: Gunfire and warplanes crush hopes for ceasefire - BBC News",
            "Sudan crisis: Will there be a ceasefire? - BBC News",
            "FBI makes arrests over US Chinese &#39;police stations&#39; – BBC News",
            "China simulates mass missile strikes on Taiwan in show of strength - BBC News",
            "Pope Francis returns to public view to mark Easter Sunday – BBC News",
            "Protests in France over pension reforms enter eleventh day - BBC News",
            "Nato gathers to welcome Finland as alliance&#39;s newest member - BBC News",
            "MI5 had intelligence linking Manchester Arena attacker to bomb plot - BBC Newsnight",
            "What will happen when Donald Trump is arrested? – BBC News",
            "Andrew Tate and Tristan Tate moved to house arrest – BBC News",
            "Turkey approves Finland Nato membership bid - BBC News",
            "Global water crisis looming, UN says - BBC News",
            "Putin warns UK over depleted uranium weapons - BBC News",
            "Warnings against ‘reckless’ weight loss surgery abroad - BBC News",
            "Ex-US Donald Trump says he expects to be arrested  – BBC News",
            "What does the arrest warrant for Russian president Vladimir Putin actually mean? – BBC News",
            "Countries that ‘mistreated&#39; Ukraine will be held to account, warns foreign minister - BBC News",
            "Credit Suisse to borrow up to $54bn from Switzerland’s central bank  - BBC News",
            "Ombudsman sceptical about ‘transparency’ of investigations into NHS trust - BBC Newsnight",
            "Russian fighter jet collides with US drone, says US military - BBC News",
            "Aukus pact: US, UK and Australia agree on nuclear submarine project - BBC News",
            "Will artificial intelligence ever become sentient? - BBC News",
            "Japan forced to blow up new rocket during failed launch. #Shorts #Japan #BBCNews",
            "Why is J-Pop&#39;s Johnny Kitagawa still revered in Japan despite being exposed for abuse? - BBC News",
            "Is cold water swimming good for you? – BBC News",
            "What do we know about the Covid-19 lab leak theory? - BBC Newsnight",
            "Prince Harry and Meghan told to &#39;vacate&#39; Frogmore cottage - BBC News",
            "California storm wreaks havoc as snow hits Los Angeles -  BBC News",
            "Is Rishi Sunak close to a deal on the Northern Ireland protocol? - BBC Newsnight",
            "The unusual dining experience powered by theme park technology - BBC News",
            "Nato chief calls on Turkey to ratify Sweden and Finland membership – BBC News",
            "How ’15-minute cities’ became a lockdown conspiracy - BBC Newsnight",
            "Russian student under house arrest for an Instagram story - BBC News",
            "What does the devastation in Turkey mean for Erdogan&#39;s future? - BBC Newsnight",
            "Civilians flee homes in Democratic Republic of Congo as M23 rebel group advance - BBC News",
            "Pope Francis visits South Sudan on ‘pilgrimage of peace’ – BBC News",
            "Chile wildfires leave several dead – BBC News",
            "China urges calm over &#39;spy&#39; balloon in US airspace – BBC News"
        ]
    },
    {
        "topic_name": "Topic 2: titanic, sub, us, search, missing",
        "titles_in_topic": [
            "State of emergency declared over Iceland volcano. #Shorts #Volcano #Iceland #BBCNews",
            "A look inside the new Las Vegas Sphere which hosted U2 #Shorts #LasVegas #BBCNews",
            "Putin vows to punish mercenaries as Wagner leader calls for rebellion against army – BBC News",
            "Families pay tribute to Titanic sub victims - BBC News",
            "Debris found near Titanic wreck in search for missing sub - BBC News",
            "How the search for the missing Titanic tourist sub has played out. #Shorts #OceanGate #BBCNews",
            "Titanic sub: How oxygen could be conserved on board - BBC News",
            "Titanic sub: More deep-sea search equipment joins hunt for Titan - BBC News",
            "Titanic sub: Search enters &#39;critical&#39; phase - BBC News",
            "Titanic sub: Safety concerns were raised about missing submersible - BBC News",
            "New noises heard as Titanic sub search widens - BBC News",
            "Oceangate whistleblower expressed safety concerns over missing Titanic sub - BBC News",
            "Titanic sub: Underwater sounds heard in search for vessel - BBC News",
            "Missing Titanic sub has 40 hours of oxygen left says US Coast Guard - BBC News",
            "Titanic sub: Search teams race against time to find missing vessel - BBC News",
            "Major search continues for missing Titanic wreck submarine - BBC News",
            "US Secretary of State Antony Blinken begins meetings in China – BBC News",
            "Plans to train Ukraine pilots to fly Western fighter jets to be discussed by Nato  – BBC News",
            "Nottingham: Two university students among three killed in attacks in UK city - BBC News",
            "Trump&#39;s arrest in Florida explained in 90 seconds - BBC News",
            "Father of children rescued from Amazon jungle speaks. #Shorts #Amazon #Colombia #BBCNews",
            "Nicola Sturgeon: Scotland&#39;s former leader released without charge after arrest - BBC News",
            "Nicola Sturgeon: Scotland’s former leader arrested - BBC News",
            "Colombia plane crash: Four children found alive in Amazon after 40 days - BBC News",
            "Singapore restaurant only one in world selling lab-grown meat. #Shorts #Food #Singapore #BBCNews",
            "El Niño planet-warming weather phase begins - BBC News",
            "France knife attack leaves children in critical condition - BBC News",
            "Russian cyber gang Clop claims hacking of payroll data - BBC News",
            "Singapore to hold final horse race after more than 180 years – BBC News",
            "Prince Harry to give evidence in phone hacking trial in UK  – BBC News",
            "India train crash investigation begins - BBC News",
            "Do Russians really hate the US, UK and West? - BBC News",
            "Ron DeSantis launches 2024 White House bid - BBC News",
            "US distances itself from incursion into Russia&#39;s Belgorod region - BBC News",
            "Russia &#39;launches criminal case&#39; over attacks on Belgorod near Ukraine border - BBC News",
            "Prince Harry loses legal challenge over security - BBC News",
            "Buckingham Palace rejects request to return remains of Ethiopian prince - BBC News",
            "India’s centuries-old ‘unconquerable’ sea fort - BBC News",
            "Can Western economies disentangle themselves from China? - BBC Newsnight",
            "Johnny Depp discusses return to cinema after Amber Heard court case - BBC News",
            "ChatGPT boss Sam Altman questioned on AI safety in US Congress - BBC News",
            "China sentences US citizen, 78, to life in prison for spying – BBC News",
            "Cyclone Mocha: Deadly storm hits Myanmar and Bangladesh coasts - BBC News",
            "Piers Morgan: &#39;I&#39;ve never hacked a phone, I&#39;ve never told anyone to hack a phone&#39; - BBC News",
            "King Charles and the Royal Family watch the Red Arrows fly over Buckingham Palace - BBC News",
            "King’s Coronation: Royal Family appear on Buckingham Palace balcony - BBC News",
            "Serbia shooting: At least 9 killed in Belgrade school shooting - BBC News",
            "Russia launches second pre-dawn missile attack on Ukraine in three days - BBC News",
            "Canada’s 450-mile dog race through its frozen north - BBC News",
            "The Austrian salt mine where Nazis hid stolen art - BBC News",
            "Sudan conflict could engulf region, UN warns - BBC News",
            "How popular is the Royal Family in the UK? - BBC News",
            "Sudan evacuation of foreign nationals continues as fighting rages - BBC News",
            "Hong Kong&#39;s last standing protesters testing Beijing’s security law - BBC Newsnight",
            "What does the leak of Ukraine war documents tell us? – BBC News",
            "How Ai Weiwei’s years living in an underground hole haunt his art to this day - BBC Newsnight",
            "Emmanuel Macron and Ursula von der Leyen in China to ‘reset’ relations – BBC News - BBC News",
            "At least 26 dead as tornadoes ravage parts of US – BBC News",
            "Bullying and toxic culture at one of England&#39;s largest NHS trusts - BBC Newsnight",
            "Six killed by female shooter at Tennessee school - BBC News",
            "The man who discovered the &#39;abyss of time&#39; - BBC News",
            "Trolled by Elon Musk: What it’s like to report on online hate - BBC News",
            "TikTok boss grilled for hours in US Congress – BBC News",
            "India&#39;s Congress leader Rahul Gandhi sentenced to jail for Modi &#39;thieves&#39; remark - BBC News",
            "Tensions build between autism researchers and the autistic community - BBC Newsnight",
            "US drone: The hidden world beneath the Black Sea - BBC News",
            "Historic Trans-Bhutan Trail reopens after 60 years - BBC News",
            "The last ‘sworn virgins’ of Albania - BBC News",
            "How a female mayor in Tokyo is fighting Japan&#39;s sexist attitudes - BBC News",
            "Athens police clash with protesters over Greece train crash - BBC News",
            "Man who learnt to read at 18 becomes Cambridge University&#39;s youngest ever black professor - BBC News",
            "Four killed as Cyclone Freddy hits Madagascar - BBC News",
            "Sexual abuse on Kenyan tea farms uncovered - BBC News",
            "Inside Russia: Traitors and Heroes - BBC News",
            "Google launches ChatGPT rival Bard - BBC News"
        ]
    },
    {
        "topic_name": "Topic 3: earthquake, turkey, ukraine, dead, syria",
        "titles_in_topic": [
            "The crane collapsed after a powerful earthquake rocked the Philippines. #Shorts #Earthquake #BBCNews",
            "Moment a deer leaps over two cars in New Jersey. #Shorts #US #BBCNews",
            "Moment injured Gaza girl sees baby sister is alive #Shorts #Gaza #Israel #BBCNews",
            "This is the moment a whale crashed into a man wing foiling in Australia. #Shorts #Whales #BBCNews",
            "What is the Gaza Strip? #Shorts #Gaza #GazaStrip #Israel #BBCNews",
            "A glimpse at the aftermath of air strikes in Jabalia #Gaza #Shorts #BBCNews",
            "Moment driver ploughed through wall into New Jersey police squad room. #NewJersey #Shorts #BBCNews",
            "Survivors have described &quot;unimaginable scenes&quot; in the Libyan city of Derna. #Shorts #Libya #BBCNews",
            "A village near Morocco&#39;s earthquake epicentre was rocked by an aftershock. #Shorts #Morocco #BBCNews",
            "A US caver was stuck in Turkey&#39;s third deepest cave for over a week. #Shorts #Turkey #BBCNews",
            "Morocco has experienced its deadliest earthquake in 60 years. #Morocco #Earthquake #BBCNews",
            "Hawaii&#39;s Kilauea volcano erupted again on Sunday. #Shorts #KilaueaVolcano #BBCNews",
            "About 2,700 people are thought to have died in a powerful earthquake in Morocco. #Shorts #BBCNews",
            "A rare blue supermoon lit up skies all around the world. #Shorts #Supermoon #BBCNews",
            "India&#39;s Chandrayaan-3 becomes first mission to land near the Moon&#39;s south pole. #Shorts #BBCNews",
            "Nicola Bulley&#39;s death was an accident, UK coroner rules - BBC News",
            "Man guilty of murdering UK police sergeant Matiu Ratana - BBC News",
            "A woman was attacked by a dingo at a beach in Australia. #Shorts #Dingo #Australia #BBCNews",
            "Can artists protect their work from AI? – BBC News",
            "Putin threatens to destroy US F16 fighter jets if they’re sent to Ukraine - BBC News",
            "North Koreans tell BBC they are stuck and waiting to die - BBC News",
            "North Koreans tell BBC of neighbours starving to death - BBC News",
            "Russia attack on Ukraine port Odesa leaves civilians dead – BBC News",
            "How Saudi Arabia bought into golf - BBC News",
            "How harmful can ultra-processed foods be for us? - BBC News",
            "Donald Trump took US nuclear secrets and stored files in shower, charges say - BBC News",
            "Boris Johnson: Former UK prime minister quits as MP over Partygate report - BBC News",
            "What we know about Ukraine dam explosion evidence - BBC News",
            "What we know about the charges against Donald Trump – BBC News",
            "Evidence of explosion near Ukraine dam say Norway scientists - BBC News",
            "Ukraine accuses Russia of shelling Kherson evacuations – BBC News",
            "Donald Trump indicted over classified documents - BBC News",
            "France knife attack has &#39;shocked&#39; nation, prime minister says - BBC News",
            "Mike Pence tears into Donald Trump at 2024 campaign launch - BBC News",
            "What caused the Ukraine dam breach? - BBC Newsnight",
            "Ukraine war: What we know about Kakhovka dam breach - BBC News",
            "Ukraine war: Floods hit Kherson after huge dam destroyed – BBC News",
            "Ukraine dam: Thousands flee floods after dam collapse near Nova Kakhovka - BBC News",
            "Moment cat interrupts live news broadcast #Shorts #CatVideos #BBCNews",
            "Ukraine dam: Thousands evacuated from ‘critical zone’ near Kakhovka plant – BBC News",
            "Families still searching for loved ones after deadly India train crash. #Shorts #India #BBCNews",
            "US and Taiwan sign trade deal as China tensions rise - BBC News",
            "Will South Africa ignore Putin’s arrest warrant for the BRICS summit? - BBC Newsnight",
            "South Africa: On the edge of darkness - BBC News",
            "Moscow drone attacks: A new phase in the Ukraine war? - BBC Newsnight",
            "What we know about the Moscow drone attacks - BBC News",
            "Turkish election victory for Erdogan leaves nation divided - BBC News",
            "South Africa energy crisis could lose ANC government’s majority - BBC News",
            "Climate crisis: Where will it be too hot to live? - BBC Newsnight",
            "Madeleine McCann police begin search at Portugal reservoir - BBC News",
            "Can this Swedish tradition make you happier at work? - BBC News",
            "Italy&#39;s floods leave more than a dozen dead and thousands homeless - BBC News",
            "Ukraine war: US to support providing F-16 fighter jets - BBC News",
            "Imagine going to school in a shopping mall #Burlington #Shorts #BBCNews",
            "Kenya cult death toll passes 200 - BBC News",
            "China and the West: Relations in 2023 - BBC Newsnight",
            "Russia hits Ukraine’s capital Kyiv with ninth wave of missile attacks this month - BBC News",
            "World set to breach critical warming threshold warn scientists - BBC News",
            "Several dead in Italy floods – BBC News",
            "British ‘dads’ bought by pregnant migrants in visa scam - BBC Newsnight",
            "Russia hits Ukraine&#39;s capital Kyiv with &#39;exceptional&#39; number of missiles, says official - BBC News",
            "Vice and Motherboard owner files for bankruptcy - BBC News",
            "Turkey votes to decide if Erdogan remains president after 20 years #Shorts #Erdogan #Turkey #BBCNews",
            "Donald Trump talks Ukraine war and pardoning US Capitol rioters in CNN town event - BBC News",
            "Brownsville: Seven dead in Texas as car strikes people - BBC News",
            "Eurovision 2023 final rehearsals get underway in Liverpool - BBC News",
            "Wrexham: Ryan Reynolds and Rob McElhenney join open-top bus parade - BBC News",
            "Ukraine war: Crimea oil tank set ablaze by reported drone strike – BBC News",
            "Ukraine hit by Russian missile strikes with multiple people dead  - BBC News",
            "Kenya ‘starvation cult’ death toll continues to rise - BBC News",
            "Russian opposition leader Alexei Navalny facing terrorism charges - BBC News",
            "Syrian earthquake survivors feel &#39;forgotten&#39; - BBC News",
            "Rare solar eclipse thrills crowds in remote Australia. #Shorts #SolarEclipse #BBCNews",
            "Clashes erupt at contested Jerusalem holy site. #Shorts #Jerusalem #BBCNews",
            "Pope Francis in hospital with respiratory infection - BBC News",
            "North Korea publishes photos of &#39;small nuclear warheads&#39; - BBC News",
            "Mass Israel protests after Prime Minister Benjamin Netanyahu fires defence minister – BBC News",
            "Thousands turn out for Donald Trump Texas rally - BBC News",
            "Could giant kelp power our planes? - BBC News",
            "Israel PM Benjamin Netanyahu to visit UK as protests continue - BBC News",
            "London police’s ‘broken’ vetting laid bare by review - BBC Newsnight",
            "UN climate report: Scientists release ‘survival guide’ to avert climate disaster - BBC News",
            "Emergency rescue of Credit Suisse as banking fears grow - BBC News",
            "Swiss bank UBS in talks to take over troubled rival Credit Suisse – BBC News",
            "Saudi state-owned oil giant Aramco sees record profit of $161bn – BBC News",
            "Inside Turkey’s post-earthquake homelessness crisis - BBC News",
            "My Escape from Afghanistan:  Tamana’s story - BBC News",
            "Iran and Saudi Arabia agree to renew diplomatic relations after seven-year rift - BBC News",
            "What’s it like in Syria one month on from the earthquakes? - BBC Newsnight",
            "Drone captures scale of earthquake devastation one month on. #Shorts #Turkey #BBCNews",
            "Turkey-Syria earthquakes survivors living on the streets one month on - BBC News",
            "Are floating solar farms the future of clean energy? - BBC News",
            "Do we need to learn how to repair smartphones? - BBC News",
            "Greece train crash: 57 confirmed dead as public anger grows - BBC News",
            "UK Prime Minister Rishi Sunak calls for support of Northern Ireland Brexit deal - BBC News",
            "Missing Chinese billionaire Bao Fan ‘assisting authorities’ - BBC News",
            "Dry winter sees drought across parts of Europe – BBC News",
            "Would you pay to be verified on #Instagram and Facebook? #Shorts #BBCNews",
            "Turkey earthquake survivors still being rescued as death toll passes 46,000 - BBC News",
            "Residents warned about safety fears before Turkey earthquake - BBC News",
            "Earthquake-hit Syria to open more border crossings for aid delivery – BBC News",
            "Thousands left without power as Cyclone Gabrielle hits New Zealand - BBC News",
            "Turkey issues arrest warrants for buildings collapsed by earthquake - BBC News",
            "Why it&#39;s hard to get help to Syria after earthquake - BBC News",
            "Aftershock felt in Turkey as rescue missions continue - BBC News",
            "Russians in Belgorod live in fear but won’t blame Putin - BBC News",
            "More than 21,000 people confirmed dead after Turkey-Syria earthquakes - BBC News",
            "Turkey president  accepts problems with earthquake response as death toll passes 16,000 - BBC News",
            "Epsom College headteacher Emma Pattison and daughter shot dead by husband, police believe - BBC News",
            "“Tens of thousands dead” in Turkey-Syria earthquake horror - BBC News",
            "Rescue efforts continue in Turkey and Syria after two earthquakes kill thousands – BBC News",
            "More than 1,000 people confirmed dead after huge earthquake hit Turkey and Syria – BBC News",
            "Hundreds killed and thousands injured as huge earthquake hits Turkey and Syria – BBC News"
        ]
    },
    {
        "topic_name": "Topic 4: ukraine, russia, war, president, says",
        "titles_in_topic": [
            "Nasa beamed a cat video 19 million miles from space to Earth with a laser. #Shorts #Nasa #BBCNews",
            "Tributes paid to Brooklyn Nine-Nine&#39;s Andre Braugher. #Shorts #RaymondHolt #BBCNews",
            "Researchers have discovered &#39;the perfect solar system&#39; 100 light years away. #Shorts #Space #BBCNews",
            "Celebs arrived in London for Beyoncé’s Renaissance tour film premiere. #RenaissancePremiere #BBCNews",
            "It took 12 hours to rescue all eight passengers of this cable car. #Shorts #Pakistan #BBCNews",
            "Russian troops &#39;stopped a civil war&#39;, Putin tells military - BBC News",
            "Wagner to hand over military hardware to Russia - BBC News",
            "Ukrainian counter-offensive advancing on all fronts, President Zelensky says – BBC News",
            "Wagner mutiny leaders want Russia to “drown in blood,” says Putin - BBC News",
            "Russia latest: Wagner leader Prigozhin speaks for first time following mutiny - BBC News",
            "Russian defence minister shown visiting troops after Wagner mutiny – BBC News",
            "Where is Russian President Vladimir Putin? – BBC News",
            "&#39;Cracks&#39; in Putin&#39;s authority in Russia exposed by Wagner rebellion - BBC News",
            "What&#39;s happening in Russia and how could Ukraine war change? - BBC News",
            "24 hours of chaos in Russia and Ukraine frontline report - BBC News",
            "Titan sub deaths worst possible outcome says friend - BBC News",
            "Ukraine’s President Zelensky tells BBC his country will have F-16 fighter jets in months - BBC News",
            "On front line in Ukraine’s counter offensive against Russia - BBC News",
            "Ukraine making front line &#39;progress&#39; against Russia - BBC News",
            "Ukraine war must end, Russia&#39;s Putin told by South African President Ramaphosa - BBC News",
            "Ukraine war: Putin confirms first nuclear weapons moved to Belarus - BBC News",
            "How many Russians have died in the Ukraine war?  - BBC News",
            "Ukraine war: Missile and drone strikes as African leaders visit Kyiv - BBC News",
            "A woman was pulled alive from rubble in Ukraine. #Shorts #Ukraine #Russia #BBCNews",
            "Russia missile strikes hit home city of Ukraine&#39;s President Zelensky - BBC News",
            "&#39;Massive&#39; Russian missile attack on Ukraine, officials say - BBC News",
            "What we know so far as Ukraine starts counter-offensive against Russia – BBC News",
            "Ukraine claims first victories of counter-offensive against Russia - BBC News",
            "What has Ukraine’s counter offensive achieved a few days in? - BBC Newsnight",
            "Inside the Taliban&#39;s war on drugs - BBC News",
            "Afghanistan facing “mental health crisis” since Taliban takeover - BBC News",
            "Ukraine &#39;shifting towards offensive actions&#39; against Russia - BBC News",
            "Zlatan Ibrahimovic ends football career at age of 41. #Shorts #Zlatan #ZlatanIbrahimovic #BBCNews",
            "What do we know about Russia&#39;s claim it thwarted Ukraine offensive? - BBC News",
            "Russia says it thwarted major Ukrainian offensive – BBC News",
            "Poland: Thousands protest over new law - BBC News",
            "Ukraine war: Will South Africa allow Russian President Putin visit? – BBC News",
            "Ukraine power plant at risk of &#39;severe nuclear accident&#39;, says watchdog - BBC News",
            "Russia&#39;s offensive in Ukraine has &#39;failed&#39;, says former US general - BBC News",
            "Rocket launches first Chinese civilian into space - BBC News",
            "Ukraine denies drone &#39;terror attack&#39; on Russia  - BBC News",
            "Ukraine war: Russian attacks on Kyiv after intense drone barrage - BBC News",
            "Ukraine war: Kyiv hit by new massive Russian drone attack - BBC News",
            "Are automated flights the future of air travel? - BBC News",
            "Ukraine counter-offensive against Russia ‘ready to begin’ - BBC News",
            "Ukraine war: Hospital destroyed by Russian missile attack - BBC News",
            "Yevgeny Prigozhin: Who is Russia&#39;s Wagner Group leader in Ukraine war?  - BBC News",
            "Ukraine: Wagner announce Bakhmut withdrawal - BBC News",
            "Battle for control over Bakhmut continues in Ukraine – BBC News",
            "US promises more military aid for Ukraine at G7 summit- BBC News",
            "Zelensky tells G7 summit Russia does not occupy Bakhmut - BBC News",
            "US President Biden announces Ukraine military aid package - BBC News",
            "Zelensky arrives at G7 summit as world leaders call out China - BBC News",
            "Ukraine&#39;s Zelensky accuses Arab nations of turning blind to Russia invasion - BBC News",
            "Sanctions on Russia for Ukraine war promised as G7 leaders meet in Japan - BBC News",
            "Scan of Titanic reveals wreck as never seen before - BBC News",
            "What issues is Russia facing in Ukraine war? - BBC News",
            "Ukraine&#39;s President Zelensky meets UK PM Rishi Sunak in surprise trip - BBC News",
            "Russian missiles hit Ukraine Eurovision act’s city – BBC News",
            "Ukraine&#39;s President Zelensky meets with German leaders in Berlin – BBC News",
            "Ukraine&#39;s President Zelensky meets political leaders in Rome - BBC News",
            "Russia denies Ukraine’s claim of regaining ground in Bakhmut - BBC News",
            "Ukraine war: South Africa accused of supplying arms to Russia - BBC News",
            "Fentanyl: Why are so many Americans dying from synthetic opioids? - BBC News",
            "UK to send Ukraine long range missiles for Russia counter-offensive - BBC News",
            "The Defenders of Donbas: Ukraine war frontline report - BBC News",
            "Ukraine needs more time for Russia counter-offensive says Zelensky - BBC News",
            "Russia and Ukraine&#39;s fight for the last streets of Bakhmut - BBC News",
            "Ukraine says it downed Russian cruise missiles aimed at Kyiv – BBC News",
            "Ukraine’s Kyiv faces fourth missile attack from Russia in eight days – BBC News",
            "Ukraine war: Russia evacuates town near nuclear plant - BBC News",
            "Life in Russia 14 months after the Ukraine invasion- BBC News",
            "Ukraine war: Russia&#39;s Wagner Group boss says he will pull troops out of Bakhmut - BBC News",
            "Russia alleges Ukrainian sabotage after drone strike on Kremlin - BBC News",
            "Is Ukraine behind the alleged Kremlin drone attack? - BBC Newsnight",
            "Ukraine&#39;s President Zelensky speaks at The Hague - BBC News",
            "Ukraine war: Russia launches wave of air strikes - BBC News",
            "Russian navy ships near Nord Stream pipeline blast site, report says - BBC News",
            "Russian videos appearing to show Kremlin drone attack – what do we know? - BBC News",
            "Russia accuses Ukraine of Putin drone assassination attempt  - BBC News",
            "Russia accuses Ukraine of trying to assassinate President Vladimir Putin - BBC News",
            "&#39;Hungry&#39; student eats art work at Seoul museum. #Shorts #SouthKorea #BBCNews",
            "Met Gala 2023: Stars celebrate fashion designer Karl Lagerfeld - BBC News",
            "Ukraine rapidly expanding its &#39;Army of Drones&#39; - BBC News",
            "How does Joe Biden’s age compare with other world leaders? - BBC News",
            "AI: What is the future of artificial intelligence? - BBC News",
            "Alec Baldwin Rust charges dropped, say lawyers - BBC News",
            "Elon Musk’s SpaceX Starship rocket explodes minutes after launch #Shorts #Starship #ElonMusk",
            "Musk asked about labelling BBC Twitter account &#39;government funded&#39;. #Shorts #ElonMusk #BBCNews",
            "President Biden visits Northern Ireland for 25th anniversary of Good Friday Agreement - BBC News",
            "Ukraine: Russia&#39;s war crimes since invasion in tens of thousands, says Kyiv - BBC News",
            "France&#39;s President Macron hopes China&#39;s President Xi will &#39;bring Russia to its senses&#39; - BBC News",
            "Inside the life coaching cult that takes over lives - BBC News",
            "Israel police clash with Palestinians at al-Aqsa mosque - BBC News",
            "Jacinda Ardern makes final speech in New Zealand parliament - BBC News",
            "Finland flag raised at Nato headquarters - BBC News",
            "Spain’s Catalonia region in worst drought in decades - BBC News",
            "Russia detains suspect over killing of pro-Ukraine war blogger Vladlen Tatarsky  - BBC News",
            "Russia’s Wagner group claims control of Bakhmut in Ukraine  – BBC News",
            "Finland PM Sanna Marin defeated by conservatives in tight election race - BBC News",
            "Russia promoting use of nuclear weapons, Nobel-winning journalist says – BBC News",
            "Nashville school killer:  police release attack footage - BBC News",
            "Exact spot King Charles will be crowned opening to visitors – BBC News",
            "What was the strategy behind Chinese President Xi Jinping&#39;s visit to Russia? - BBC Newsnight",
            "Sri Lanka no longer a bankrupt nation, president says  - BBC News",
            "Russia&#39;s President Putin to listen to China&#39;s peace plan to end war in Ukraine - BBC News",
            "China&#39;s President Xi and Russia&#39;s President Putin meet in Moscow - BBC News",
            "Skeleton reveals early humans had sex with Neanderthals - BBC News",
            "The Slow Mo Guys: How to capture the world in slow motion - BBC News",
            "Vladimir Putin pays visit to occupied Mariupol in Ukraine – BBC News",
            "The making of Avatar: The Way of Water’s Oscar-winning visual effects - BBC News",
            "Margaret Atwood on gender, women&#39;s rights, and Roald Dahl revisions - BBC News",
            "Protests in France as President Emmanuel Macron forces through pension reform – BBC News",
            "UK bans TikTok from government mobile phones - BBC News",
            "Russia pilots &#39;reckless&#39; in drone collision, says US - BBC News",
            "Wild wolves return to Belgium after 100 years, sparking controversy - BBC News",
            "Thousands homeless as Storm Freddy tears through southern Malawi - BBC News",
            "UK PM Rishi Sunak meets with French President Emmanuel Macron in Paris - BBC News",
            "UK PM Rishi Sunak defends new asylum plan while Gary Lineker tweets criticism – BBC News",
            "Ukraine denies involvement in attack on Nord Stream pipelines – BBC News",
            "Thousands protest in Georgia after parliament backs ‘foreign agent’ bill - BBC News",
            "Ukrainian and Russian soldiers fighting in streets of Bakhmut - BBC News",
            "Ukraine city of Bakhmut surrounded, say Russian mercenaries - BBC News",
            "Far-right nationalists protest against housing refugees in Skegness hotels - BBC Newsnight",
            "How Ukrainian refugees in Poland are coping a year on from the war - BBC Newsnight",
            "Archaeologists discover oldest known sentence in first alphabet - BBC News",
            "Pasta price in UK doubles as costs of basics rises - BBC News",
            "Ukraine president hails nation&#39;s &#39;year of invincibility&#39; one year after Russia’s invasion - BBC News",
            "President Zelensky welcomes UN vote for withdrawal of Russian troops from Ukraine - BBC News",
            "European Commission bans staff from using TikTok – BBC News",
            "Reporting the Ukraine war from inside Russia - BBC News",
            "Putin stages huge pro-war rally to mark Ukraine invasion anniversary - BBC News",
            "Biden meets Nato allies in Poland after Putin appears at rally – BBC News",
            "Joe Biden to contest Vladimir Putin claims in Poland speech – BBC News",
            "Why TikTok sleuths descended on Nicola Bulley&#39;s village - BBC News",
            "British fighters in Ukraine share footage of the frontline with BBC Newsnight",
            "US President Joe Biden makes surprise visit to Kyiv ahead of Ukraine war anniversary – BBC News",
            "Inside the country backing Russia’s invasion of Ukraine - BBC Newsnight visits Serbia",
            "Actor Bruce Willis diagnosed with dementia, family says - BBC News",
            "Belarus will join Russia if attacked by Ukraine, says Lukashenko - BBC News",
            "Ukraine President Zelensky rules out territory deal with Russia - BBC News",
            "Inside a prisoner of war camp for Russians in Ukraine – BBC News",
            "Warming ocean melting weak spots into vast Antarctic glacier - BBC News",
            "Syrians would rather die than accept aid via Assad-held areas, says Idlib minister - BBC Newsnight",
            "US recovers Chinese balloon sensors from ocean - BBC News",
            "Russians slowly take ground around Ukrainian city of Bakhmut - BBC News",
            "Ukraine to get more Western tanks from Germany, the Netherlands and Denmark - BBC News",
            "ChatGPT can write a Newsnight script but can AI rescue big tech? - BBC Newsnight",
            "Inside the UK’s first spaceport - BBC News"
        ]
    },
    {
        "topic_name": "Topic 5: coronation, king, charles, new, trump",
        "titles_in_topic": [
            "YouTuber Ruby Franke pleads guilty to child abuse #Shorts #RubyFranke #BBCNews",
            "Former US first ladies honour Rosalyn Carter at her memorial service. #JimmyCarter #Shorts #BBCNews",
            "First video of Indian workers trapped in tunnel. #Shorts #Uttarakhand #BBCNews",
            "Who is Spain&#39;s Princess Leonor? #Shorts #Spain #BBCNews",
            "Titanic tourist sub wreckage brought ashore - BBC News",
            "Russian rouble falls to 15-month low before recovering following Wagner rebellion – BBC News",
            "Wagner forces halt advance on Moscow after calls for rebellion – BBC News",
            "Wagner mercenaries say they control key Russian city as convoy heads towards Moscow  – BBC News",
            "Paris explosion leaves several people in critical condition - BBC News",
            "How Donald Trump&#39;s day in Miami court unfolded. #Shorts #DonaldTrump #BBCNews",
            "Donald Trump gives New Jersey speech after Miami court appearance – BBC News",
            "AI law to be voted on in Europe - BBC News",
            "Donald Trump due to appear in federal courthouse over secret files – BBC News",
            "Donald Trump arrives in Florida ahead of court appearance - BBC News",
            "British girl shot dead in France while playing in garden - BBC News",
            "‘Floating landmines’ warning as Ukrainians flee dam disaster - BBC News",
            "Prince Harry says he brought hacking case to stop hate against Meghan - BBC News",
            "PGA Tour and LIV Golf agree merger to end split in golf – BBC News",
            "Apple&#39;s new augmented reality headset unveiled - BBC News",
            "Are social media companies removing war crimes evidence? - BBC News",
            "Vaping: What are the medical impacts? - BBC News",
            "Phillip Schofield: UK TV presenter admits affair with younger ITV employee - BBC News",
            "Vinicius Jr: La Liga club Valencia fined after racist abuse of Real Madrid forward - BBC News",
            "Harrison Ford delivers emotional speech as he accepts Cannes award #Shorts #HarrisonFord #BBCNews",
            "Disney scraps $867m Florida plan amid Ron DeSantis feud – BBC News",
            "Inside El Salvador’s gang crackdown - BBC News",
            "Prince Harry and Meghan involved in New York car chase – BBC News",
            "Swiss village of Brienz evacuated over risk of imminent rockslide - BBC News",
            "Coronation concert: Prince William &#39;so proud&#39; of King Charles  - BBC News",
            "King&#39;s Coronation: The last lamplighters of London - BBC News",
            "Prince William kisses King Charles after oath in Coronation #Shorts #Coronation #BBCNews",
            "Moment King Charles III is formally crowned #Shorts #Coronation #BBCNews",
            "Moment HM King Charles III is crowned in Coronation ceremony - BBC News",
            "Prince Harry arrives at King Charles&#39;s Coronation in Westminster Abbey - BBC News",
            "Who will crown King Charles at Westminster Abbey Coronation? - BBC News",
            "Coronation: Princess Anne rejects calls for a ‘slimmed down’ monarchy - BBC News",
            "Inside King Charles III’s golden coronation carriage. #Shorts #Coronation #BBCNews",
            "King Charles: Public invited to swear allegiance to king during Coronation – BBC News",
            "Tucker Carlson leaves Fox News - BBC News",
            "Inside a submarine smuggling cocaine to Europe – BBC News",
            "Inside a submarine smuggling cocaine to Europe – BBC News",
            "Will new UK voter ID rules make it harder to vote? - BBC News",
            "US police forces using controversial facial recognition technology - BBC News",
            "Russian ships accused of North Sea sabotage – BBC News",
            "Alleged Russian spy ships accused of North Sea sabotage - BBC News",
            "China rehearses &#39;sealing off&#39; Taiwan in third day of drills – BBC News",
            "Cybercrime website Genesis Market shut down in global law enforcement crackdown - BBC News",
            "Who killed Russian military blogger Vladlen Tatarsky? - BBC Newsnight",
            "Donald Trump to appear in New York court to face criminal charges - BBC News",
            "Russian military blogger Vladlen Tatarsky killed in St Petersburg explosion - BBC News",
            "How abandoned coal mines could heat our homes - BBC News",
            "British &#39;danger tourist&#39; and charity workers held by Taliban in Afghanistan - BBC News",
            "Donald Trump to become first ex-US president to face criminal charges - BBC News",
            "The New York restaurant introducing Nigerian cuisine to the US - BBC News",
            "California hit by further storm, leaving at least two dead – BBC News",
            "More French anti-government protests over pension reforms - BBC News",
            "How Iraq invasion led by US and UK sparked decades of chaos and violence  - BBC News",
            "NASA unveils new spacesuit ahead of Artemis III moon mission - BBC News",
            "Protests continue in Georgia despite draft law withdrawal - BBC News",
            "Have SNP members decided on a new leader? - BBC Newsnight",
            "Taliban bars female students from returning to universities in Afghanistan - BBC News",
            "Thousands in Bangladesh without shelter after fire at Rohingya camp – BBC News",
            "TikTok sets daily screen time limit for under-18s - BBC News",
            "How are England&#39;s deprived areas coping with rising cost of living? - BBC Newsnight",
            "US Supreme Court deliberates student loan forgiveness plan - BBC News",
            "Dozens dead after trains collide in northern Greece – BBC News",
            "‘Mega-prison’ to hold 40,000 people in El Salvador. #Shorts #ElSalvador #BBCNews",
            "59 people including 12 children drown as boat sinks off Italy - BBC News",
            "Migrant boat sinks off Italy coast killing dozens of people – BBC News",
            "Have archaeologists found India’s lost port of Muziris? - BBC News",
            "Bulgarian police find 18 people dead in abandoned truck - BBC News",
            "Who is Nikki Haley, the trailblazer challenging Donald Trump in 2024? - BBC News",
            "Top Iran chess player Sara Khadem exiled for refusing headscarf – BBC News",
            "Are robot companions good for the elderly? - BBC News",
            "All Quiet on the Western Front’s Felix Kammerer reflects on acting in his first film - BBC Newsnight",
            "Orca mothers make &#39;lifelong sacrifice&#39; for sons - BBC News"
        ]
    }
]